Tekla Open API Reference for Tekla Structures 2025
EnvironmentVariables Methods
The EnvironmentVariables type exposes the following members.
Methods
Name | Description
Add
 Adds a variable to the list.
Get
 Gets a key.
GetEnvironmentVariable
 Gets an environment variable.
Top
See Also
Reference
EnvironmentVariables Class
Tekla.Structures.Dialog.UIControls Namespace